content/posts/first-blog.md
+++
title = "New blog !"
description = "a completly useless blog post, basically trying out hugo."
date = 2021-10-18
tags = ["hugo"]
draft = false
author = "Youssef Bouzekri"
+++

Hello once again to my redesigned blog, this time using [hugo](https://gohugo.io) as the backend with [ox-hugo](https://ox-hugo.scripter.co/) which converts my org-written blog posts to markdown.

through out this post, I will be testing ox-hugo's features and see what is possible !


## Heading 1 {#heading-1}

this is fun, hugo supports rich text, so I can have, **bold** and _italic_ text and even `inline code blocks`


### heading 2 {#heading-2}

I don't think I'll ever go beyond heading 2, this is a **very** useful bit of javascript code

```js
console.log("hello world")
for(let i = 0; i > 10; i++){
    console.log(i)
}
```

> I don't like how quote blocks look, but that is fine tbh.

I can have lists:

-   Milk
-   House
-   Door

and even ordered ones:

1.  what's up
2.  I like this very much
